lchangh0/stm32/code-f446/work/Core/Inc/basic.h
/*
 * basic.h
 *
 *  Created on: Feb 22, 2025
 *      Author: user
 */

#ifndef INC_BASIC_H_
#define INC_BASIC_H_

#include "stm32f4xx_hal.h"
#include <stdio.h>
#include <string.h>

typedef uint8_t byte;

#define TRUE 1
#define FALSE 0


extern ADC_HandleTypeDef hadc1;

extern CAN_HandleTypeDef hcan1;

extern TIM_HandleTypeDef htim1;
extern TIM_HandleTypeDef htim2;
extern TIM_HandleTypeDef htim3;
extern TIM_HandleTypeDef htim4;

extern UART_HandleTypeDef huart2;
extern UART_HandleTypeDef huart5;

extern SPI_HandleTypeDef hspi1;
extern SPI_HandleTypeDef hspi2;
extern SPI_HandleTypeDef hspi3;

uint32_t GetTick();
uint32_t GetElapsedTick(uint32_t start);

void InitDWT(void);
void DelayUS(uint32_t us);
void DelayMS(uint32_t ms);

uint32_t GetCycCnt();
uint32_t GetElapsedCycUS(uint32_t start);

void InitUartRxInterrupt();
uint8_t GetUart2RxByte(uint8_t* rx);
uint8_t GetUart5RxByte(uint8_t* rx);

void Error_Handler(void);


#endif /* INC_BASIC_H_ */
